{
    "buttons": {
        "readMore": "Read more",
        "submit": "Send",
        "back": "Back"
    },

    "toast": {
        "messageSent": "Message sent!",
        "error": "Message could not be sent. Try again later."
    },

    "navigation": {
        "about": "Me",
        "work": "Projects",
        "contact": "Contact"
    },
    
    "myIntroduction": {
        "greeting": "Hi! I'm Tuuli.",
        "aboutMe": "I'm getting my degree on Business Information Systems in September. During my studies I've gained valuable experience in various projects and roles. I'm enthusiastic about UX design and web development and enjoy working with TypeScript, React and CSS. I also learned WordPress during my internship. On my spare time I'm working on a 2D pixel art game project. I'm looking for a job where I can develop digital products in a customer-oriented way."
    },

    "contactMe": {
        "title": "Contact me",
        "desc": "Thanks for stopping by! If you want to get in touch with me about work related things or in the spirit of networking, then please fill out the form below, email me or send me a message on ",
        "linkedin": "LinkedIn.",
        "name": "Your name",
        "email": "Your email",
        "subject": "Subject",
        "message": "Message"
    },

    "projects": {
        "title": "Projects",
        "desc": "",
        "techs": {
            "FIGMA": "Figma",
            "REACT": "React",
            "AWS": "AWS",
            "KRITA": "Krita"
        },
        "bakeryApp": {
            "imgAlts": {
                "home": "Bakery mobile ordering app's home page."
            },
            "title": "Bakery Mobile Ordering App Design",
            "titleShort": "Bakery Mobile App",
            "dateRole": "Spring 2023 | UX/UI Design",
            "desc": "A design of a mobile app for ordering goods from a local bakery. The app provides the customers an easy way to access detailed information on used ingredients and nutrition charts, in order to support the customers making the most suitable choices for themselves and to alleviate concerns about allergens.",
            "linkText": "View ",
            "link": "prototype",
            "overview": {
                "heading": "Overview",
                "problem": "Problem: ",
                "problemContent": "Some people have limitations on what they can eat or need more information on their food for other reasons. This information isn't always easy to find.",
                "goal": "Goal:",
                "goalContent": " Design an app that makes finding suitable food options faster and more comfortable."
            },
            "understanding": {
                "heading": "Understanding",
                "userResearch": {
                    "heading": "User research summary",
                    "competitiveAudit": "The competitive audit showed lack of ingredient and nutrition information on other ordering apps/websites.",
                    "empathy": "I created user personas in order to better understand the users' wants and needs. The user group I focused on was working adults between the ages of 20 and 60 years old.",
                    "revelation": "Research revealed three major user pain points."
                },
                "painPoints": {
                    "heading": "Pain points",
                    "inconvenience": "Inconvenience ",
                    "inconvenienceText": "- Trying to find information about allergens and nutrition values feels inconvenient.",
                    "time": "Time ",
                    "timeText": "- Finding suitable food options takes too long.",
                    "uncertainty": "Uncertainty ",
                    "uncertaintyText": "- Not sure what the food contains. 'Can I eat this?'"
                },
                "persona": {
                    "heading": "Persona - Manu",
                    "problemStatement": "Problem statement ",
                    "problemStatementText": "- Manu is a junior employee in an HR consulting firm who needs a faster way to find suitable food options for their coworkers because of the coworkers' allergies."
                },
                "userJourney": {
                    "heading": "User journey map - Manu",
                    "journey": "Mapping Manu's journey revealed that a way to filter the products could ",
                    "quickenProcess": "quicken the ordering process",
                    "and": " and",
                    "helpUsers": " help the users make more confident choices"
                }
            },
            "designStart": {
                "heading": "Starting the design",
                "summary": "After gathering empathy and understanding for the users' pain points, I drafter paper wireframes which were then turned into digital wireframes. The screens were then connected into a low-fidelity prototype and utilized for a usability study.",
                "paperWireframes": {
                    "heading": "Paper wireframes",
                    "iteration": "Wireframing on paper enabled quick iteration and trying out different layouts for the home page before moving on to digital wireframing.",
                    "ideation": "I ideatiated five different versions of the home page.",
                    "refinedVersion": "After assessing the best features of the differend wirefames I built a refined version of the home screen."

                },
                "digitalWireframes": {
                    "heading": "Digital Wireframes",
                    "designs": "As the initial design phase continued, I made sure to base screen designs on findings from the user research."

                },
                "lofiPrototype": {
                    "heading": "Low-fidelity prototype",
                    "userFlow": "I connected the digital wireframe screens in order to create the primary user flow, which presents the process of ordering bakery goods.",
                    "prototypeText": "View bakery mobile app's ",
                    "prototypeLink": "low-fidelity prototype"
                },
                "usabilityFindings": {
                    "heading": "Usability study findings",
                    "changes": "From testing the low-fidelity prototype on five users, I could determine that the following changes were needed:",
                    "backButton": "Back button was missing from the profile page.",
                    "dietaryNeeds": "Users felt that reading ingredient lists is tiring and there should be quicker way to find out, if the product is suitable for their dietary needs.",
                    "orders": "Users needed a clearer way to access orders."
                }
            },
            "designRefine": {
                "heading": "Refining the design",
                "mockups": {
                    "heading": "Mockups",
                    "dietaryTags": "Dietary tags were added to product page. Tags will help the user quickly decide if the product is suitable for them, without reading the ingredient list. The layout was modified to fit these new elements.",
                    "addToCart": "'Add to cart' button was accompanied by an element that shows how many items have been added so that the user can add many items at once and see how many items have been already added.",
                    "profilePage": "Profile page was redesigned and missing back button added. All the user information can be accessed and edited in a uniform way.",
                    "sections": "Information was divided into small sections, which makes it easy to read. Orders can be found at the top of the page."
                },
                "keyMockups": {
                    "heading": "Key mockups",
                    "orderingFlow": "Some key screens from the ordering flow."
                },
                "hifiPrototype": {
                    "heading": "High-fidelity prototype",
                    "final": "The final high-fidelity prototype presented cleaner user flows for navigating the app and ordering bakery goods.",
                    "prototypeText": "View bakery mobile app's ",
                    "prototypeLink": "high-fidelity prototype"
                },
                "accessibility": {
                    "heading": "Accessibility",
                    "colors": "WCAG guidelines on color contrast were followed.",
                    "icons": "Used icons to help make navigation easier.",
                    "language": "Kept language simple.",
                    "pictures": "Used pictures for the products."
                }
            },
            "takeaways": {
                "heading": "Takeaways",
                "impact": "Impact: ",
                "impactText": "The app makes users feel like they can make informed decisions on their bakery ordering choices.",
                "whatLearned": "What I learned: ",
                "whatLearnedText": "I learned to trust the iteration process more. It can feel overwhelming to start from nothing, but I am happy how far I have gotten with this app design.",
                "nextSteps": {
                    "heading": "Next steps",
                    "usabilityStudy": "Conduct another round of usability studies to validate whether the pain points users experienced have been effectively addressed.",
                    "research": "Conduct more user research to determine any new areas of need."
                }
            }
        },

        "danceVote": {
            "imgAlt": "Voting room page of the DanceVote app.",
            "title": "UX and UI design of a Voting App (Thesis)",
            "titleShort": "DanceVote",
            "dateRole": "Fall 2022 | UX/UI Design",
            "desc": "The objective of the thesis was to design a user interface for a voting application so that the audience could take part in judging. The commissioner of this thesis was Groove Connection Oy which is a limited company that organizes social partner dance competitions. The company hoped to lighten the workload of its judges. The thesis resulted in an interactive prototype that was used in the programming of the web application.",
            "grade": "Grade: 5",
            "theseusText": "Read more on ",
            "theseusLink": "Theseus",
            "overview": {
                "heading": "Overview",
                "problem": "Problem: ",
                "problemContent": "Judging in dance competitions is tiring and time consuming. How could the workload of the judges be lightened?",
                "goal": "Goal: ",
                "goalContent": "Design a UI for a voting application so that the audience can participate in the judging of dance competitions."
            },
            "understanding": {
                "heading": "Understanding",
                "userResearch": {
                    "heading": "User research summary",
                    "empathy": "Empathy maps and user personas were created in order to understand better the users' needs.",
                    "competitiveAudit": "The research made it clear that there is not much competition in voting apps aimed at dance competitions.",
                    "revelation": "It was concluded that a simple, easy-to-use and accessible app would serve the cause well."
                },
                "personaAntti": {
                    "heading": "Persona - Antti",
                    "problemStatement": "Problem statement ",
                    "problemStatementText": "- Antti is a color-blind and dyslexic student who needs more websites and applications that consider people like him because he does not want to feel like an outsider."
                },
                "personaJouni": {
                    "heading": "Persona - Jouni",
                    "problemStatement": "Problem statement ",
                    "problemStatementText": "Jouni is a organizer of the vote who needs an easy-to-use app aimed at dance events because he wants the voting to go smoothly."
                },
                "ideation": {
                    "heading": "Ideation",
                    "crazyEights": "I used the crazy eights exercise for brainstorming different home page layouts. The goal was to fit all the elements on the page in a way that feels intuitive and to keep the 'joining the voting room' functionality as the highest priority.",
                    "refinedVersion": "After the exercise I evaluated each screen and then built a refined version of the home page based on the preferred features."
                }
            },
            "wireframes": {
                "heading": "Wireframes",
                "designs": "After ideating, I created the initial digital designs for the DanceVote app. These plans focused on getting an idea of how the voter should go through the voting process and how the app would look to the vote organizer.",
                "voteOrganizer": "Log in process",
                "voter": "Voting room and sending the vote",
                "votingRoom": "Voting room with better accessibility and intuitivity by adding arrows to move the pairs up or down the list."
            },
            "designRefine": {
                "heading": "Prototype",
                "mockups": {
                    "heading": "Mockups"
                },
                "keyMockups": {
                    "heading": "Key mockups",
                    "votingFlow": "Some key screens from the voting flow."
                },
                "hifiPrototype": {
                    "heading": "High-fidelity prototype",
                    "final": "The final high-fidelity prototype presented cleaner user flows for navigating the app and ordering bakery goods.",
                    "prototypeText": "View DanceVote app's ",
                    "prototypeLink": "high-fidelity prototype"
                },
                "accessibility": {
                    "heading": "Accessibility",
                    "wcag": "WCAG guidelines followed in: ",
                    "typography":  "Typograpghy",
                    "colors": "Color contrasts",
                    "targetSize": "Target sizes"
                }
            },
            "takeaways": {
                "heading": "Takeaways",
                "impact": "Impact: ",
                "impactText": "The project resulted in an interactive prototype that models the appearance and functionality of the final application. In the prototype, the user can participate in voting, view voting results or create and manage their own voting.",
                "whatLearned": "What I learned: ",
                "whatLearnedText": "Conducting usability study made me remember once again the importance of it. The user can always notice or feel something unexpected about the design.",
                "nextSteps": {
                    "heading": "Next steps",
                    "ui": "Enchance the UI with animations and images.",
                    "accessibility": "Test accessibility."
                }
            }
        },
        
        "farmersApp": {
            "imgAlt": "'My boxes' page.",
            "title": "Web App for Farmers",
            "dateRole": "Spring 2021 | Web Development",
            "team": "Team members: 10",
            "role": "My role: 1 of the 3 developers, front-end",
            "desc": "An international customer project where a web app prototype was designed and developed. The app is a refill management solution for farmers who want to sell their products with salesboxes. With the app the farmer can see real-time stock level data of the products that have been added to the database and also delete and edit the products.",
            "linkText": "View ",
            "link": "Github repository"
        },

        "projectBaltic": {
            "title": "Project Baltic: Save the Baltic Sea the mobile game",
            "dateRole": "Spring 2020 | Mobile game",
            "team": "Team members: 4",
            "role": "My role: graphics",
            "desc": "In Project Baltic the player buys and maintains farms in the Baltic Sea region. The goal the game is to save the Baltic sea by updating the farms in an environmentally friendly way and at the same time learn about the nutrient cycle. The game was implemented by first-year students of Tampere University of Applied Sciences in cooperation with the Oras project.",
            "link": "Project Baltic's home page",
            "gallery": "Gallery"
        }
    }
}