{
    "buttons": {
        "readMore": "Lue lisää",
        "submit": "Lähetä",
        "back": "Takaisin"
    },

    "toast": {
        "messageSent": "Viesti lähetetty!",
        "error": "Viestiä ei voitu lähettää. Kokeile myöhemmin uudelleen."
    },

    "navigation": {
        "about": "Minä",
        "work": "Projektit",
        "contact": "Ota yhteyttä"
    },

    "myIntroduction": {
        "greeting": "Moikka! Mä oon Tuuli.",
        "aboutMe": "Valmistuin elokuussa 2024 tietojenkäsittelyn tradenomiksi ja etsin työpaikkaa, jossa pääsen kehittämään digitaalisia tuotteita käyttäjälähtöisesti. Opintojeni aikana innostuin erityisesti UX- ja UI-suunnittelusta ja frontend-kehityksestä Reactilla ja TypeScriptilla. Työharjoittelun myötä myös WordPressistä tuli tutumpi, kun suunnittelin ja toteutin yritykselle verkkosivut. Hauskana vapaa-ajan projektina teen kumppanin kanssa peliä 2D-pikseligrafiikoilla."
    },

    "contactMe": {
        "title": "Ota yhteyttä",
        "desc": "Kiva, että eksyit sivuilleni! Jos haluat olla yhteyksissä töiden tai verkostoitumisen puitteissa, täytä alla oleva lomake, laita sähköpostia tai lähetä minulle viesti ",
        "linkedin": "LinkedInissä.",
        "name": "Nimesi",
        "email": "Sähköpostisi",
        "subject": "Aihe",
        "message": "Viesti"
    },

    "projects": {
        "title": "Projektit",
        "desc": "Projekteja opinnoistani.",
        "techs": {
            "FIGMA": "Figma",
            "REACT": "React",
            "AWS": "AWS",
            "KRITA": "Krita"
        },
        "bakeryApp": {
            "imgAlts": {
                "home": "Leipomosovelluksen aloitusnäyttö."
            },
            "title": "Leipomon mobiiilitilausovelluksen UX/UI",
            "titleShort": "Leipomon sovellus",
            "dateRole": "Kevät 2023 | UX/UI-suunnittelu",
            "desc": "Käyttöliittymän suunnitelma mobiilisovelluksesta leipomotuotteiden tilaamiseen paikallisesta leipomosta. Sovelluksella asiakkkaat pääsevät helposti käsiksi yksityiskohtaisiin tietoihin ainesosista ja ravintosisällöistä. Tarkoitus on auttaa asiakkaita tekemään sopivia valintoja ja lievittämään huolta allergeeneista.",
            "linkText": "Kokeile ",
            "link": "prototyyppiä",
            "overview": {
                "heading": "Yhteenveto",
                "problem": "Ongelma: ",
                "problemContent": "Joillakin ihmisillä on rajoituksia sen suhteen, mitä he voivat syödä, tai he tarvitsevat muista syistä lisätietoa ruoastaan. Tätä tietoa ei ole aina helppo löytää.",
                "goal": "Tavoite: ",
                "goalContent": "Suunnittele sovellus, joka tekee sopivien ruokavaihtoehtojen löytämisestä nopeampaa ja miellyttävämpää."
            },
            "understanding": {
                "heading": "Ymmärrys",
                "userResearch": {
                    "heading": "Käyttäjätutkimuksen yhteenveto",
                    "competitiveAudit": "Kilpailija-analyysistä kävi ilmi, että ainesosa- ja ravintosisältötietojen tarjoamisessa oli puutteita joissakin muissa tilaussovelluksissa/verkkosivustoilla.",
                    "empathy": "Loin käyttäjäpersoonia ymmärtääkseni paremmin käyttäjien haluja ja tarpeita. Käyttäjäryhmään sisällytettiin 20-60-vuotiaat työssäkäyvät aikuiset.",
                    "revelation": "Tutkimus paljasti kolme kipupistettä."
                },
                "painPoints": {
                    "heading": "Kipupisteet",
                    "inconvenience": "Epäkäytännöllisyys ",
                    "inconvenienceText": "- Tietojen etsiminen allergeeneista ja ravintoarvoista tuntuu vaivalloiselta.",
                    "time": "Aika ",
                    "timeText": "- Sopivien ruokavaihtoehtojen löytämiseen menee liikaa aikaa.",
                    "uncertainty": "Epävarmuus ",
                    "uncertaintyText": "- Epävarmuus siitä, mitä ruoka sisältää. 'Voinko syödä tätä?'"
                },
                "persona": {
                    "heading": "Persoona - Manu",
                    "problemStatement": "Problem statement ",
                    "problemStatementText": "- Manu is HR-konsultointiyhtiön juniori työntekijä, joka tarvitsee nopeamman tavan löytää työkavereilleen sopivia ruokavaihtoehtoja, sillä heillä on erilaisia allergioita."
                },
                "userJourney": {
                    "heading": "User journey map - Manu",
                    "journey": "Manun matkan kartoittaminen paljasti, että mahdollisuus suodattaa tuotteita voisi ",
                    "quickenProcess": "nopeuttaa tilauksen tekemistä",
                    "and": " ja",
                    "helpUsers": " auttaa käyttäjiä tekemään varmempia valintoja"
                }
            },
            "designStart": {
                "heading": "Suunnittelun alku",
                "summary": "Kerättyäni empatiaa ja ymmärrystä käyttäjien kipupisteitä kohtaan, luonnostelin paperisia rautalankamalleja, joista muodostin digitaalisia rautalankamalleja. Näytöt yhdistettiin matalan tarkkuuden prototyypiksi, jota hyödynnettiin käyttäjätestauksessa.",
                "paperWireframes": {
                    "heading": "Paperiset rautalankamallit",
                    "iteration": "Rautalankamallien piirtäminen paperille mahdollisti nopean iteroinnin ja erilaisten sommitelmien kokeilemisen ennen kuin siirryin digitaalisiin rautalankamalleihin.",
                    "ideation": "Ideoin aloitusnäytöstä viisi erilaista versiota.",
                    "refinedVersion": "Yhdistelin näyttöjen parhaita ominaisuuksia muodostaakseni aloitusnäytön parannellun version."
                },
                "digitalWireframes": {
                    "heading": "Digitaaliset rautalankamallit",
                    "designs": "Suunnittelun alkuvaiheen jatkuessa varmistin, että käyttöliittymän suunnittelu perustuisi käyttäjätutkimuksen tuloksiin."

                },
                "lofiPrototype": {
                    "heading": "Matalan tason prototyyppi",
                    "userFlow": "Yhdistin digitaalisen rautalankamallin näkymät toisiinsa kuvaamaan käyttäjän ensisijaista flow:ta eli leipomotuotteiden tilaamista.",
                    "prototypeText": "Kokeile leipomosovelluksen ",
                    "prototypeLink": "low-fi prototyyppiä"
                },
                "usabilityFindings": {
                    "heading": "Käytettävyystutkimuksen tulokset",
                    "changes": "Testattuani prototyyppiä viidellä käyttäjällä päätin, että seuraavat muutokset olivat tarpeen:",
                    "backButton": "Takaisin-nappi puuttui profiilisivulta.",
                    "dietaryNeeds": "Käyttäjistä tuntui, että ainesosalistojen lukeminen on raskasta, ja että pitäisi olla nopeampi tapa saada selville, sopiiko tuote heidän ruokavalioonsa.",
                    "orders": "Käyttäjät tarvitsevat selkeämmän tavan löytää tilauksensa sovelluksesta."
                }
            },
            "designRefine": {
                "heading": "Suunnitelman hiominen",
                "mockups": {
                    "heading": "Mockupit",
                    "dietaryTags": "Ruokavaliomerkinnät lisättiin tuotesivulle. Merkinnät auttavat käyttäjää päättämään ilman ainesosalistan lukemista, onko tuote sopiva hänelle. Uusille elementeille tehtiin tilaa muokkaamalla sivun ulkoasua.",
                    "addToCart": "'Add to cart' -painikkeen vierelle lisättiin elementti, jonka avulla käyttäjä voi suoraan vaikuttaa tuotteen kappalemäärään ostoskorissa.",
                    "profilePage": "Profiilisivu suunniteltiin uudelleen ja puuttuva takaisin-painike lisättiin. Käyttäjätietojen esittäminen ja muokkaaminen tapahtuu yhtenäisemmällä tavalla.",
                    "sections": "Tiedot jaettiin pieniin osioihin, jotta teksti olisi helppolukuisempaa. Tilaukset löytyvät sivun yläosasta."
                },
                "keyMockups": {
                    "heading": "Keskeisiä mockuppeja",
                    "orderingFlow": "Keskeisiä näyttöjä tilausprosessista."
                },
                "hifiPrototype": {
                    "heading": "Korkean tason prototyyppi",
                    "final": "High-fidelity eli korkean tason prototyyppi esittää selkeämmän käyttäjän polun sovelluksessa liikkumiseen ja leipototuotteiden tilaamiseen.",
                    "prototypeText": "Kokeile leipomosovelluksen ",
                    "prototypeLink": "hi-fi prototyyppiä"
                },
                "accessibility": {
                    "heading": "Saavutettavuus",
                    "colors": "WCAG-ohjeistuksia noudatettiin värien kontrasteissa.",
                    "icons": "Ikoneja käytettiin navigoinnin helpottamiseksi.",
                    "language": "Kieli on yksinkertaista.",
                    "pictures": "Kuvia käytettiin tuotekuvausten yhteydessä."
                }
            },
            "takeaways": {
                "heading": "Loppusanat",
                "impact": "Merkitys: ",
                "impactText": "Sovellus saa käyttäjät tuntemaan, että he tekevät tietoisia valintoja tilatessaan leipomosta.",
                "whatLearned": "Mitä opin: ",
                "whatLearnedText": "Opin luottamaan iterointiin enemmän. Voi tuntua joltain aloittaa tyhjästä, mutta olen iloinen, siitä, kuinka pitkälle olen päässyt",
                "nextSteps": {
                    "heading": "Jatkokehitys",
                    "usabilityStudy": "Tee toinen käytettävyystutkimuskierros vahvistaaksesi, onko käyttäjien kokemiin kipupisteisiin vastattu tehokkaasti.",
                    "research": "Tee lisää käyttäjätutkimusta uusien tarpeiden määrittämiseksi."
                }
            }
        },

        "danceVote": {
            "imgAlt": "DanceVote-sovelluksen äänestyshuone.",
            "title": "Äänestyssovelluksen UX- ja UI-suunnittelu (Opinnäytetyö)",
            "titleShort": "DanceVote",
            "dateRole": "Syksy 2022 | UX/UI-suunnittelu",
            "desc": "Opinnäytyön tavoitteena oli yleisöäänestyssovelluksen käyttöliittymän ja käyttäjäkokemuksen suunnittelu. Toimeksiantaja Groove Connection Oy on sosiaalisen paritanssin kilpailuja järjestävä osakeyhtiö, joka halusi keventää tapahtumiensa tuomarien työtaakkaa. Opinnäytetyön tuloksena syntyi interaktiivinen prototyyppi, jonka pohjalta voitiin ohjelmoida tanssikilpailuissa hyodynnettävä verkkosovellus.",
            "grade": "Arvosana: 5",
            "theseusText": "Lue lisää ",
            "theseusLink": "Theseuksessa",
            "overview": {
                "heading": "Yhteenveto",
                "problem": "Ongelma:  ",
                "problemContent": "Tanssikilpailuissa tuomaroiminen on raskasta ja aikaa vievää. Miten tuomarien työtaakkaa voitaisiin keventää?",
                "goal": "Tavoite: ",
                "goalContent": "Luo DanceVote-yleisöäänestyssovelluksen interaktiinen prototyyppi, joka mallintaa ohjelmoitavan sovelluksen ulkonäköä ja toiminnallisuutta."
            },
            "understanding": {
                "heading": "Ymmärrys",
                "userResearch": {
                    "heading": "Käyttäjätutkimuksen yhteenveto",
                    "empathy": "Ymmärtääkseni paremmin käyttäjien tarpeita loin suunnittelun alussa empatiakarttoja ja käyttäjäpersoonia.",
                    "competitiveAudit": "Tutkimalla muita äänestyssovelluksia kävi ilmi, että tanssikilpailuille suunnatuissa äänestyssovelluksissa ei ollut paljon kilpailua.",
                    "revelation": "Oli todettavissa, että yksinkertainen, helppokäyttöinen ja saavutettava sovellus voisi täyttää tämän markkinaraon."
                },
                "personaAntti": {
                    "heading": "Persona - Antti",
                    "problemStatement": "Problem statement ",
                    "problemStatementText": "-  Antti on värisokea ja lukivaikeuksinen äänestäjä, joka tarvitsee enemmän sovelluksia, joiden suunnittelussa olisi huomioitu hänen kaltaisensa ihmiset, koska hän ei halua tuntea oloaan ulkopuoliseksi."
                },
                "personaJouni": {
                    "heading": "Persoona - Jouni",
                    "problemStatement": "Problem statement ",
                    "problemStatementText": "Jouni on äänestyksen järjestäjä, joka tarvitsee tanssikilpailuille suunnatun helppokäyttöisen äänestyssovelluksen, jotta yleisöäänestys sujuisi mahdollisimman mutkattomasti."
                },
                "ideation": {
                    "heading": "Ideointi",
                    "crazyEights": "Ideoin crazy eights -harjoituksen avulla erilaisia vaihtoehtoja aloitusnäytön asettelusta. Tavoitteena oli saada kaikki elementit mahtumaan sivulle intuitiivisella tavalla pitäne äänestykseen liittymisen korkeimpana prioriteettina.",
                    "refinedVersion": "Harjoituksen jälkeen arvioin jokaisen ja rakensin aloitusnäytöstä parannellun version parhaiden ominaisuuksien perusteella."
                }
            },
            "wireframes": {
                "heading": "Rautalankamallit",
                "designs": "Ideoinnin jälkeen tein DanceVote-sovelluksen alustavan digitaalisen suunnitelman. Suunnitelman avulla oli tarkoitus hahmotella, miltä sovellus näyttäisi äänestäjälle vs. äänestyksen järjestäjälle.",
                "voteOrganizer": "Sisäänkirjautuminen",
                "voter": "Äänestyshuone ja äänen lähettäminen",
                "votingRoom": "Äänestyssivun saavutettavampi ja intuitiivisempi versio. Painamalla nuolia tanssipari siirtyy sijoituksessa ylös- tai alaspäin."
            },
            "designRefine": {
                "heading": "Prototyyppi",
                "mockups": {
                    "heading": "Mockupit"
                },
                "keyMockups": {
                    "heading": "Keskeisiä mockuppeja",
                    "votingFlow": "Keskeisiä näyttöjä äänestysprosessista."
                },
                "hifiPrototype": {
                    "heading": "High-fidelity prototype",
                    "final": "The final high-fidelity prototype presented cleaner user flows for navigating the app and ordering bakery goods.",
                    "prototypeText": "Kokeile DanceVote-sovelluksen ",
                    "prototypeLink": "prototyyppiä"
                },
                "accessibility": {
                    "heading": "Saavutettavuus",
                    "wcag": "WCAG-ohjeita seurattiin: ",
                    "typography":  "Typografiassa",
                    "colors": "Värien kontrasteissa",
                    "targetSize": "Kohteiden koossa"
                }
            },
            "takeaways": {
                "heading": "Loppusanat",
                "impact": "Merkitys: ",
                "impactText": "Opinnäytetyön tuloksena syntyi interaktiivinen prototyyppi, joka mallintaa lopullisen sovelluksen ulkonäköä ja toiminnallisuutta. Käyttäjä voi osallistua äänestykseen, tarkastella äänestystuloksia tai luoda ja hallinnoida omia äänestyksiään.",
                "whatLearned": "Mitä opin: ",
                "whatLearnedText": "Käyttäjätutkimuksen tekeminen sai minut jälleen kerran muistamaan sen tärkeyden. Käyttäjä voi aina tuntea jotain odottamatonta.",
                "nextSteps": {
                    "heading": "Jatkokehitys",
                    "ui": "Käyttöliittymän elävöittäminen animaatioilla ja kuvilla.",
                    "accessibility": "Saavutettavuuden testaaminen."
                }
            }
        },

        "farmersApp": {
            "imgAlt": "My boxes -sivu.",
            "title": "Verkkosovellus maanviljelijöille",
            "dateRole": "Kevät 2021 | Web-ohjelmointi",
            "team": "Tiimin jäseniä: 10",
            "role": "Roolini: yksi kolmesta ohjelmoijasta, front-end",
            "desc": "Kansainvälinen asiakasprojekti, jossa suunniteltiin ja toteutettiin verkkosovelluksen prototyyppi, jonka avulla maanviljelijät voivat nähdä reaaliaikaista dataa myyntilaatikoidensa täyttöasteista. Sovellus mahdollistaa tuotteiden lisäämisen, poistamisen ja muokkaamisen."
        },

        "projectBaltic": {
            "title": "Project Baltic: Itämeren pelastusmobiilipeli",
            "dateRole": "Kevät 2020 | Mobiilipeli",
            "team": "Tiimin jäseniä: 4",
            "role": "Roolini: grafiikat",
            "desc": "Project Balticissa pelaaja ostaa ja ylläpitää maatiloja Itämeren alueella. Pelin tavoitteena on pelastaa Itämeri päivittämällä maatiloja ympäristöystävällisesti sekä samalla oppia ravinteiden kierrosta. Peli toteutettiin Tampereen ammattikorkeakoulun tietojenkäsittelyn ensimmäisen vuoden opiskelijoiden toimesta yhteistyössä Oras-hankkeen kanssa.",
            "link": "Project Balticin kotisivu",
            "gallery": "Galleria"
        }

    }
}
